In [50]:
import pandas as pd
from database import mongoConnector

In [51]:
sojaData = pd.read_excel('cepea_soja.xls', 'Plan 1', index=False)
sojaData.head()

         Data  À vista R$  À vista US$
0  13/03/2006       27.66        12.96
1  14/03/2006       27.45        12.91
2  15/03/2006       27.58        13.00
3  16/03/2006       26.97        12.78
4  17/03/2006       26.96        12.68

In [52]:
sojaData['Data'] = pd.to_datetime(sojaData['Data'], format='%d/%m/%Y')
sojaData['À vista US$'] = pd.to_numeric(sojaData['À vista US$'])
sojaData.drop('À vista R$', axis=1, inplace=True)
sojaData.columns = ['date', 'price']
sojaData.sort_values(by='date',inplace=True, ascending=True)
sojaData.head()

        date  price
0 2006-03-13  12.96
1 2006-03-14  12.91
2 2006-03-15  13.00
3 2006-03-16  12.78
4 2006-03-17  12.68

In [53]:
suinoData = pd.read_excel('cepea_suinos.xls', 'Plan 1', index=False)
suinoData['Data'] = pd.to_datetime(suinoData['Data'], format='%d/%m/%Y')

In [55]:
suinoData.MG = suinoData.MG.astype(float).fillna(0.0)
suinoData.PR = suinoData.PR.astype(float).fillna(0.0)
suinoData.RS = suinoData.RS.astype(float).fillna(0.0)
suinoData.SC = suinoData.SP.astype(float).fillna(0.0)
suinoData.sort_values(by='Data',inplace=True, ascending=True)
suinoData.head()

        Data    MG    PR    RS    SC    SP
0 2010-07-01  2.73  2.21  2.21  2.56  2.56
1 2010-07-02  2.76  2.22  2.22  2.57  2.57
2 2010-07-05  2.73  2.22  2.20  2.58  2.58
3 2010-07-06  2.73  2.22  2.23  2.59  2.59
4 2010-07-07  2.73  2.26  2.21  2.59  2.59

In [56]:
milhoData = pd.read_excel('cepea_milho.xls', 'Plan 1', index=False)
milhoData.head()

         Data  À vista R$  À vista US$
0  02/08/2004       18.24         5.98
1  03/08/2004       18.04         5.91
2  04/08/2004       18.02         5.90
3  05/08/2004       18.06         5.89
4  06/08/2004       18.13         5.98

In [57]:
milhoData['Data'] = pd.to_datetime(milhoData['Data'], format='%d/%m/%Y')
milhoData['À vista US$'] = pd.to_numeric(milhoData['À vista US$'])
milhoData.drop('À vista R$', axis=1, inplace=True)
milhoData.columns = ['date', 'price']
milhoData.sort_values(by='date',inplace=True, ascending=True)
milhoData.head()

        date  price
0 2004-08-02   5.98
1 2004-08-03   5.91
2 2004-08-04   5.90
3 2004-08-05   5.89
4 2004-08-06   5.98

In [59]:
from database import mongoConnector
mongo = mongoConnector()
suino = mongo.db.suinoPreco

In [60]:
suino.insert_many(suinoData.to_dict('records'))

In [61]:
milho = mongo.db.milhoPreco
milho.insert_many(milhoData.to_dict('records'))

In [62]:
soja = mongo.db.sojaPreco
soja.insert_many(sojaData.to_dict('records'))